stychos/carviston/sdkconfig.defaults
# Carviston defaults

# Target
CONFIG_IDF_TARGET="esp32s3"

# 16 MB flash, octal PSRAM (N16R8)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# HTTP server features we'll need
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024

# Raise the LWIP socket ceiling (default 10) so esp_http_server can run a
# larger pool. The single httpd worker reserves 3 sockets; with 16 total that
# leaves room for max_open_sockets=12 — enough headroom for two dashboard tabs
# (each: one /ws + several keep-alive HTTP conns) plus reconnects, instead of
# refusing connections at the 7-socket default. See web_server_start().
CONFIG_LWIP_MAX_SOCKETS=16

# mbedtls — HMAC/SHA256 already on by default; PBKDF2 is implemented in auth.c

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Main task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- Matter -----------------------------------------------------------------
# Matter is ON by default. Requires the esp-matter SDK to be installed and
# sourced alongside ESP-IDF — see docs/MATTER.md. To strip Matter (and BLE)
# out for a smaller, local-only build, set CARVISTON_MATTER_ENABLE=n in
# menuconfig and the dependent options below also become n.
CONFIG_CARVISTON_MATTER_ENABLE=y

# BLE — used only during Matter commissioning. The "BLE only for
# commissioning" flag releases BLE RAM after pairing completes so the
# heater isn't paying for an idle BT stack the rest of its lifetime.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_ENABLE_CHIPOBLE=y
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=y

# Matter factory data partition — see partitions.csv (matter_fac, 64 KB).
CONFIG_FACTORY_PARTITION_NAME="matter_fac"

# Let the espressif/mdns component handle mDNS — chip's built-in minimal
# mDNS conflicts with the carviston.local advertisement from wifi_mgr.c.
CONFIG_USE_MINIMAL_MDNS=n
